---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ColumnInsideWallFailures.CopingWarningExtension
source: html/ccd8d9b7-3d56-e352-54eb-e3972553a34e.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ColumnInsideWallFailures.CopingWarningExtension Property

Coping applied, but no cut was made. Adjust Coping Distance or Extension parameters.

## Syntax (C#)
```csharp
public static FailureDefinitionId CopingWarningExtension { get; }
```